// PLUGINS IMPORTS //
import React from 'react';
import {ScrollView, View, StyleSheet} from 'react-native';
import Button from '~/Content/Shared/Components/Buttons/Button/Button';
import Text from '~/Content/Shared/Components/Text/Text';

// COMPONENTS IMPORTS //

// EXTRA IMPORTS //

/////////////////////////////////////////////////////////////////////////////

const Main = () => {
  return (
    <ScrollView style={styles.wrapper}>
      <Text>
        Товариство з обмеженою відповідальністю "САППОРТ.УА", юридична особа,
        належним чином створена, зареєстрована та діюча у відповідності до
        законодавства України, іменована надалі за текстом – "Виконавець", в
        особі директора Кірія Євгена Володимировича, який діє на підставі
        Статуту,
      </Text>
      <View style={styles.title_block}>
        <Text size={18} isCenterAlign>
          Стаття 1
        </Text>
        <Text size={18} isCenterAlign>
          ПРЕДМЕТ ДОГОВОРУ
        </Text>
      </View>
      <Text style={styles.paragraph}>
        1.1. В порядку, строки та на умовах, передбачених даним Договором та
        Додатками до нього, що є його невід’ємними складовими, Виконавець
        приймає на себе зобов’язання організувати надання послуг (виконання
        робіт), передбачених відповідним Сервісом (надалі – "послуги" та/або
        "роботи"), Замовникам, які є законними власниками / володільцями Сервісу
        та товару, на який розповсюджується Сервіс.
      </Text>
      <Text style={styles.paragraph}>
        1.2. Сервіс - розроблений / поєднаний Виконавцем комплекс послуг та/або
        робіт щодо відповідного товару, які надаються Замовникам, які є
        законними власниками / володільцями таких товару та Сервісу. Додатково
        вживаються назви «Пакет послуг», «Сертифікат», що за змістом та суттю є
        аналогічними визначенню поняття «Сервіс».
      </Text>
      <Text style={styles.paragraph}>
        1.3. Повний перелік діючих Сервісів Виконавця, їх зміст та наповнення
        (перелік послуг та/або робіт), що входять до кожного Сервісу, строки,
        порядок та умови надання (виконання) таких послуг (робіт), строк дії
        Сервісу, та інша інформація), визначається в Додатку № 1 до даного
        Договору, що є його невід’ємною складовою.
      </Text>
      <Text>
        1.4. Найменування Сервісу та дата укладення цього Договору зазначаються
        у розрахунковому документі, який надається Замовнику після оплати
        вартості Сервісу (сплати суми Договору) в місці придбання Сервісу
        (укладення Договору), а саме – у партнерів Виконавця (магазини,
        Інтернет-магазини, онлайн-майданчики та ін.) або безпосередньо у
        Виконавця. Для умов даного Договору під розрахунковим документом Сторони
        мають на увазі будь-який (в тому числі електронний) документ, виданий
        продавцем, банком чи фінансовою установою, в тому числі, але не
        обмежуючись: фіскальний чек, товарний чек, прибутковий касовий ордер,
        квитанція, платіжне доручення, що підтверджує сплату вартості Сервісу
        (сплату суми Договору) будь-яким не забороненим законодавством України
        способом.
      </Text>
    </ScrollView>
  );
};

const styles = StyleSheet.create({
  wrapper: {
    marginHorizontal: 20,
    marginVertical: 32,
  },

  title_block: {
    marginTop: 20,
    marginBottom: 15,
  },

  paragraph: {
    marginBottom: 15,
  },
});

export default React.memo(Main);
